CREATE DATABASE  IF NOT EXISTS `mental_health` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `mental_health`;
-- MySQL dump 10.13  Distrib 8.0.40, for Win64 (x86_64)
--
-- Host: localhost    Database: mental_health
-- ------------------------------------------------------
-- Server version	8.0.40

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `admin`
--

DROP TABLE IF EXISTS `admin`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `admin` (
  `account` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '账号',
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '管理员姓名',
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '密码',
  PRIMARY KEY (`account`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='管理员表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `admin`
--

LOCK TABLES `admin` WRITE;
/*!40000 ALTER TABLE `admin` DISABLE KEYS */;
INSERT INTO `admin` VALUES ('admin','管理员1','admin@123456'),('operator','管理员2','operator@654321');
/*!40000 ALTER TABLE `admin` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `appointment`
--

DROP TABLE IF EXISTS `appointment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `appointment` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `appointment_no` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '预约编号',
  `student_account` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '学生账号或学号',
  `teacher_account` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '心理老师账号',
  `schedule_id` bigint NOT NULL COMMENT '办公时间ID',
  `appointment_date` date NOT NULL COMMENT '预约日期',
  `start_time` time NOT NULL COMMENT '预约开始时间',
  `end_time` time NOT NULL COMMENT '预约结束时间',
  `purpose` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '预约目的',
  `remark` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '学生备注',
  `teacher_reply` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '老师回复',
  `reject_reason` varchar(500) COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '拒绝原因',
  `status` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'PENDING' COMMENT 'PENDING待审核 APPROVED已通过 REJECTED已拒绝 CANCELLED已取消 COMPLETED已完成',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `approved_at` datetime DEFAULT NULL,
  `cancelled_at` datetime DEFAULT NULL,
  `completed_at` datetime DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_appointment_no` (`appointment_no`),
  KEY `fk_appointment_schedule` (`schedule_id`),
  KEY `idx_appointment_student_account` (`student_account`),
  KEY `idx_appointment_teacher_account` (`teacher_account`),
  KEY `idx_appointment_date` (`appointment_date`),
  KEY `idx_appointment_status` (`status`),
  CONSTRAINT `fk_appointment_schedule` FOREIGN KEY (`schedule_id`) REFERENCES `teacher_schedule` (`id`),
  CONSTRAINT `fk_appointment_teacher` FOREIGN KEY (`teacher_account`) REFERENCES `teacher` (`account`)
) ENGINE=InnoDB AUTO_INCREMENT=12 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='学生心理预约表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `appointment`
--

LOCK TABLES `appointment` WRITE;
/*!40000 ALTER TABLE `appointment` DISABLE KEYS */;
INSERT INTO `appointment` VALUES (1,'APT1773729908706','2023010101','teacher02',3,'2026-03-17','15:00:00','17:00:00','学习压力','无',NULL,NULL,'CANCELLED','2026-03-17 14:45:09','2026-03-18 12:37:51',NULL,'2026-03-18 12:37:51',NULL),(2,'APT1773808704307','2023010101','teacher01',2,'2026-03-18','09:00:00','11:00:00','无','',NULL,NULL,'CANCELLED','2026-03-18 12:38:24','2026-03-18 12:38:33',NULL,'2026-03-18 12:38:33',NULL),(3,'APT1773808742764','2023010101','teacher01',2,'2026-03-18','09:00:00','11:00:00','无\n','',NULL,NULL,'CANCELLED','2026-03-18 12:39:03','2026-03-18 12:39:10',NULL,'2026-03-18 12:39:10',NULL),(4,'APT1773996887002','2023010101','teacher01',2,'2026-03-25','09:00:00','11:00:00','wu','','ok',NULL,'COMPLETED','2026-03-20 16:54:47','2026-03-20 16:54:47','2026-03-20 16:55:21',NULL,'2026-03-20 16:55:47'),(5,'APT1774001073764','2023010101','teacher02',3,'2026-03-24','15:00:00','17:00:00','wu','','',NULL,'APPROVED','2026-03-20 18:04:34','2026-03-20 18:04:34','2026-03-20 18:05:47',NULL,NULL),(6,'APT1774064432466','2023010101','teacher01',1,'2026-03-23','14:00:00','17:00:00','学习压力','','ok',NULL,'COMPLETED','2026-03-21 11:40:32','2026-03-21 11:40:32','2026-03-21 11:42:48',NULL,'2026-03-21 11:43:01'),(7,'APT1774170387110','2023010101','teacher01',7,'2026-03-22','08:00:00','12:00:00','1','','',NULL,'COMPLETED','2026-03-22 17:06:27','2026-03-22 17:06:27','2026-03-22 17:08:11',NULL,'2026-03-22 19:40:28'),(8,'APT1774179655370','2023010101','teacher01',7,'2026-03-22','08:00:00','12:00:00','无','','没啥问题',NULL,'COMPLETED','2026-03-22 19:40:55','2026-03-22 19:40:55','2026-03-22 19:45:28',NULL,'2026-03-26 11:50:35'),(9,'APT1774496177337','2023010101','teacher01',1,'2026-03-30','14:00:00','17:00:00','wu','',NULL,NULL,'REJECTED','2026-03-26 11:36:17','2026-03-26 11:36:17',NULL,NULL,NULL),(10,'APT1774500675584','2023010101','teacher02',4,'2026-03-26','09:00:00','12:00:00','w','',NULL,NULL,'PENDING','2026-03-26 12:51:16','2026-03-26 12:51:16',NULL,NULL,NULL),(11,'APT1774500700747','2023010101','teacher01',1,'2026-03-30','14:00:00','17:00:00','wu1','',NULL,'先完成心理测试','REJECTED','2026-03-26 12:51:41','2026-03-26 12:51:41',NULL,NULL,NULL);
/*!40000 ALTER TABLE `appointment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `assessment_option`
--

DROP TABLE IF EXISTS `assessment_option`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `assessment_option` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `question_id` bigint NOT NULL,
  `option_no` int NOT NULL,
  `option_text` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `option_score` int NOT NULL,
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `fk_option_question` (`question_id`),
  CONSTRAINT `fk_option_question` FOREIGN KEY (`question_id`) REFERENCES `assessment_question` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=571 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='心理测评选项表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assessment_option`
--

LOCK TABLES `assessment_option` WRITE;
/*!40000 ALTER TABLE `assessment_option` DISABLE KEYS */;
INSERT INTO `assessment_option` VALUES (391,64,1,'从未',0,'2026-03-15 02:29:57'),(392,65,1,'从未',0,'2026-03-15 02:29:57'),(393,66,1,'从未',0,'2026-03-15 02:29:57'),(394,67,1,'从未',0,'2026-03-15 02:29:57'),(395,68,1,'从未',0,'2026-03-15 02:29:57'),(398,64,2,'偶尔',1,'2026-03-15 02:29:57'),(399,65,2,'偶尔',1,'2026-03-15 02:29:57'),(400,66,2,'偶尔',1,'2026-03-15 02:29:57'),(401,67,2,'偶尔',1,'2026-03-15 02:29:57'),(402,68,2,'偶尔',1,'2026-03-15 02:29:57'),(405,64,3,'少于一半时间',2,'2026-03-15 02:29:57'),(406,65,3,'少于一半时间',2,'2026-03-15 02:29:57'),(407,66,3,'少于一半时间',2,'2026-03-15 02:29:57'),(408,67,3,'少于一半时间',2,'2026-03-15 02:29:57'),(409,68,3,'少于一半时间',2,'2026-03-15 02:29:57'),(412,64,4,'超过一半时间',3,'2026-03-15 02:29:57'),(413,65,4,'超过一半时间',3,'2026-03-15 02:29:57'),(414,66,4,'超过一半时间',3,'2026-03-15 02:29:57'),(415,67,4,'超过一半时间',3,'2026-03-15 02:29:57'),(416,68,4,'超过一半时间',3,'2026-03-15 02:29:57'),(419,64,5,'大部分时间',4,'2026-03-15 02:29:57'),(420,65,5,'大部分时间',4,'2026-03-15 02:29:57'),(421,66,5,'大部分时间',4,'2026-03-15 02:29:57'),(422,67,5,'大部分时间',4,'2026-03-15 02:29:57'),(423,68,5,'大部分时间',4,'2026-03-15 02:29:57'),(426,64,6,'一直如此',5,'2026-03-15 02:29:57'),(427,65,6,'一直如此',5,'2026-03-15 02:29:57'),(428,66,6,'一直如此',5,'2026-03-15 02:29:57'),(429,67,6,'一直如此',5,'2026-03-15 02:29:57'),(430,68,6,'一直如此',5,'2026-03-15 02:29:57'),(433,69,1,'完全没有',0,'2026-03-15 02:29:57'),(434,70,1,'完全没有',0,'2026-03-15 02:29:57'),(435,71,1,'完全没有',0,'2026-03-15 02:29:57'),(436,72,1,'完全没有',0,'2026-03-15 02:29:57'),(437,73,1,'完全没有',0,'2026-03-15 02:29:57'),(438,74,1,'完全没有',0,'2026-03-15 02:29:57'),(439,75,1,'完全没有',0,'2026-03-15 02:29:57'),(440,76,1,'完全没有',0,'2026-03-15 02:29:57'),(441,77,1,'完全没有',0,'2026-03-15 02:29:57'),(448,69,2,'几天',1,'2026-03-15 02:29:57'),(449,70,2,'几天',1,'2026-03-15 02:29:57'),(450,71,2,'几天',1,'2026-03-15 02:29:57'),(451,72,2,'几天',1,'2026-03-15 02:29:57'),(452,73,2,'几天',1,'2026-03-15 02:29:57'),(453,74,2,'几天',1,'2026-03-15 02:29:57'),(454,75,2,'几天',1,'2026-03-15 02:29:57'),(455,76,2,'几天',1,'2026-03-15 02:29:57'),(456,77,2,'几天',1,'2026-03-15 02:29:57'),(463,69,3,'一半以上天数',2,'2026-03-15 02:29:57'),(464,70,3,'一半以上天数',2,'2026-03-15 02:29:57'),(465,71,3,'一半以上天数',2,'2026-03-15 02:29:57'),(466,72,3,'一半以上天数',2,'2026-03-15 02:29:57'),(467,73,3,'一半以上天数',2,'2026-03-15 02:29:57'),(468,74,3,'一半以上天数',2,'2026-03-15 02:29:57'),(469,75,3,'一半以上天数',2,'2026-03-15 02:29:57'),(470,76,3,'一半以上天数',2,'2026-03-15 02:29:57'),(471,77,3,'一半以上天数',2,'2026-03-15 02:29:57'),(478,69,4,'几乎每天',3,'2026-03-15 02:29:57'),(479,70,4,'几乎每天',3,'2026-03-15 02:29:57'),(480,71,4,'几乎每天',3,'2026-03-15 02:29:57'),(481,72,4,'几乎每天',3,'2026-03-15 02:29:57'),(482,73,4,'几乎每天',3,'2026-03-15 02:29:57'),(483,74,4,'几乎每天',3,'2026-03-15 02:29:57'),(484,75,4,'几乎每天',3,'2026-03-15 02:29:57'),(485,76,4,'几乎每天',3,'2026-03-15 02:29:57'),(486,77,4,'几乎每天',3,'2026-03-15 02:29:57'),(493,78,1,'完全没有',0,'2026-03-15 02:29:57'),(494,79,1,'完全没有',0,'2026-03-15 02:29:57'),(495,80,1,'完全没有',0,'2026-03-15 02:29:57'),(496,81,1,'完全没有',0,'2026-03-15 02:29:57'),(497,82,1,'完全没有',0,'2026-03-15 02:29:57'),(498,83,1,'完全没有',0,'2026-03-15 02:29:57'),(499,84,1,'完全没有',0,'2026-03-15 02:29:57'),(500,78,2,'几天',1,'2026-03-15 02:29:57'),(501,79,2,'几天',1,'2026-03-15 02:29:57'),(502,80,2,'几天',1,'2026-03-15 02:29:57'),(503,81,2,'几天',1,'2026-03-15 02:29:57'),(504,82,2,'几天',1,'2026-03-15 02:29:57'),(505,83,2,'几天',1,'2026-03-15 02:29:57'),(506,84,2,'几天',1,'2026-03-15 02:29:57'),(507,78,3,'一半以上天数',2,'2026-03-15 02:29:57'),(508,79,3,'一半以上天数',2,'2026-03-15 02:29:57'),(509,80,3,'一半以上天数',2,'2026-03-15 02:29:57'),(510,81,3,'一半以上天数',2,'2026-03-15 02:29:57'),(511,82,3,'一半以上天数',2,'2026-03-15 02:29:57'),(512,83,3,'一半以上天数',2,'2026-03-15 02:29:57'),(513,84,3,'一半以上天数',2,'2026-03-15 02:29:57'),(514,78,4,'几乎每天',3,'2026-03-15 02:29:57'),(515,79,4,'几乎每天',3,'2026-03-15 02:29:57'),(516,80,4,'几乎每天',3,'2026-03-15 02:29:57'),(517,81,4,'几乎每天',3,'2026-03-15 02:29:57'),(518,82,4,'几乎每天',3,'2026-03-15 02:29:57'),(519,83,4,'几乎每天',3,'2026-03-15 02:29:57'),(520,84,4,'几乎每天',3,'2026-03-15 02:29:57'),(521,94,1,'从不',1,'2026-03-15 02:29:57'),(522,93,1,'从不',1,'2026-03-15 02:29:57'),(523,92,1,'从不',1,'2026-03-15 02:29:57'),(524,91,1,'从不',1,'2026-03-15 02:29:57'),(525,90,1,'从不',1,'2026-03-15 02:29:57'),(526,89,1,'从不',1,'2026-03-15 02:29:57'),(527,88,1,'从不',1,'2026-03-15 02:29:57'),(528,87,1,'从不',1,'2026-03-15 02:29:57'),(529,86,1,'从不',1,'2026-03-15 02:29:57'),(530,85,1,'从不',1,'2026-03-15 02:29:57'),(531,94,2,'偶尔',2,'2026-03-15 02:29:57'),(532,93,2,'偶尔',2,'2026-03-15 02:29:57'),(533,92,2,'偶尔',2,'2026-03-15 02:29:57'),(534,91,2,'偶尔',2,'2026-03-15 02:29:57'),(535,90,2,'偶尔',2,'2026-03-15 02:29:57'),(536,89,2,'偶尔',2,'2026-03-15 02:29:57'),(537,88,2,'偶尔',2,'2026-03-15 02:29:57'),(538,87,2,'偶尔',2,'2026-03-15 02:29:57'),(539,86,2,'偶尔',2,'2026-03-15 02:29:57'),(540,85,2,'偶尔',2,'2026-03-15 02:29:57'),(541,94,3,'有时',3,'2026-03-15 02:29:57'),(542,93,3,'有时',3,'2026-03-15 02:29:57'),(543,92,3,'有时',3,'2026-03-15 02:29:57'),(544,91,3,'有时',3,'2026-03-15 02:29:57'),(545,90,3,'有时',3,'2026-03-15 02:29:57'),(546,89,3,'有时',3,'2026-03-15 02:29:57'),(547,88,3,'有时',3,'2026-03-15 02:29:57'),(548,87,3,'有时',3,'2026-03-15 02:29:57'),(549,86,3,'有时',3,'2026-03-15 02:29:57'),(550,85,3,'有时',3,'2026-03-15 02:29:57'),(551,94,4,'经常',4,'2026-03-15 02:29:57'),(552,93,4,'经常',4,'2026-03-15 02:29:57'),(553,92,4,'经常',4,'2026-03-15 02:29:57'),(554,91,4,'经常',4,'2026-03-15 02:29:57'),(555,90,4,'经常',4,'2026-03-15 02:29:57'),(556,89,4,'经常',4,'2026-03-15 02:29:57'),(557,88,4,'经常',4,'2026-03-15 02:29:57'),(558,87,4,'经常',4,'2026-03-15 02:29:57'),(559,86,4,'经常',4,'2026-03-15 02:29:57'),(560,85,4,'经常',4,'2026-03-15 02:29:57'),(561,94,5,'总是',5,'2026-03-15 02:29:57'),(562,93,5,'总是',5,'2026-03-15 02:29:57'),(563,92,5,'总是',5,'2026-03-15 02:29:57'),(564,91,5,'总是',5,'2026-03-15 02:29:57'),(565,90,5,'总是',5,'2026-03-15 02:29:57'),(566,89,5,'总是',5,'2026-03-15 02:29:57'),(567,88,5,'总是',5,'2026-03-15 02:29:57'),(568,87,5,'总是',5,'2026-03-15 02:29:57'),(569,86,5,'总是',5,'2026-03-15 02:29:57'),(570,85,5,'总是',5,'2026-03-15 02:29:57');
/*!40000 ALTER TABLE `assessment_option` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `assessment_question`
--

DROP TABLE IF EXISTS `assessment_question`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `assessment_question` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `scale_id` bigint NOT NULL,
  `question_no` int NOT NULL,
  `question_text` varchar(500) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `required_flag` tinyint NOT NULL DEFAULT '1',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `fk_question_scale` (`scale_id`),
  CONSTRAINT `fk_question_scale` FOREIGN KEY (`scale_id`) REFERENCES `assessment_scale` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=95 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='心理测评题目表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assessment_question`
--

LOCK TABLES `assessment_question` WRITE;
/*!40000 ALTER TABLE `assessment_question` DISABLE KEYS */;
INSERT INTO `assessment_question` VALUES (64,14,1,'过去两周，我感觉心情愉快、精神较好',1,'2026-03-15 02:29:57'),(65,14,2,'过去两周，我感觉平静、放松',1,'2026-03-15 02:29:57'),(66,14,3,'过去两周，我感觉精力充沛、做事有劲头',1,'2026-03-15 02:29:57'),(67,14,4,'过去两周，我起床后感觉休息充分',1,'2026-03-15 02:29:57'),(68,14,5,'过去两周，我的日常生活里有让我感兴趣的事情',1,'2026-03-15 02:29:57'),(69,15,1,'过去两周，做事兴趣下降或提不起劲',1,'2026-03-15 02:29:57'),(70,15,2,'过去两周，情绪低落、沮丧或感到无望',1,'2026-03-15 02:29:57'),(71,15,3,'过去两周，入睡困难、易醒或睡得过多',1,'2026-03-15 02:29:57'),(72,15,4,'过去两周，感到疲惫或缺乏精力',1,'2026-03-15 02:29:57'),(73,15,5,'过去两周，食欲差或吃得过多',1,'2026-03-15 02:29:57'),(74,15,6,'过去两周，对自己评价很差，觉得自己失败或让家人失望',1,'2026-03-15 02:29:57'),(75,15,7,'过去两周，难以集中注意力，如学习或阅读时难专心',1,'2026-03-15 02:29:57'),(76,15,8,'过去两周，动作或说话明显变慢，或坐立不安比平时更明显',1,'2026-03-15 02:29:57'),(77,15,9,'过去两周，出现过伤害自己或认为不如消失的想法',1,'2026-03-15 02:29:57'),(78,16,1,'过去两周，感到紧张、焦虑或神经绷得很紧',1,'2026-03-15 02:29:57'),(79,16,2,'过去两周，无法停止担忧或控制担忧',1,'2026-03-15 02:29:57'),(80,16,3,'过去两周，过度担心各种事情',1,'2026-03-15 02:29:57'),(81,16,4,'过去两周，难以放松下来',1,'2026-03-15 02:29:57'),(82,16,5,'过去两周，坐立不安，难以安静坐着',1,'2026-03-15 02:29:57'),(83,16,6,'过去两周，容易烦躁或被激怒',1,'2026-03-15 02:29:57'),(84,16,7,'过去两周，总担心会有糟糕的事情发生',1,'2026-03-15 02:29:57'),(85,4,1,'过去30天里，你是否无明显原因地感到疲惫？',1,'2026-03-15 02:29:57'),(86,4,2,'过去30天里，你是否感到紧张？',1,'2026-03-15 02:29:57'),(87,4,3,'过去30天里，你是否紧张到难以平静下来？',1,'2026-03-15 02:29:57'),(88,4,4,'过去30天里，你是否感到没有希望？',1,'2026-03-15 02:29:57'),(89,4,5,'过去30天里，你是否感到坐立不安或心烦意乱？',1,'2026-03-15 02:29:57'),(90,4,6,'过去30天里，你是否坐立不安到根本坐不住？',1,'2026-03-15 02:29:57'),(91,4,7,'过去30天里，你是否感到情绪低落？',1,'2026-03-15 02:29:57'),(92,4,8,'过去30天里，你是否觉得做任何事都很费力？',1,'2026-03-15 02:29:57'),(93,4,9,'过去30天里，你是否悲伤到没有什么能让你开心起来？',1,'2026-03-15 02:29:57'),(94,4,10,'过去30天里，你是否感到自己毫无价值？',1,'2026-03-15 02:29:57');
/*!40000 ALTER TABLE `assessment_question` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `assessment_scale`
--

DROP TABLE IF EXISTS `assessment_scale`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `assessment_scale` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `scale_code` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `scale_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `scale_type` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL,
  `description` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `question_count` int NOT NULL,
  `score_min` int NOT NULL,
  `score_max` int NOT NULL,
  `status` tinyint NOT NULL DEFAULT '1',
  `deleted_flag` tinyint NOT NULL DEFAULT '0' COMMENT '0未删除 1已逻辑删除',
  `current_version_id` bigint DEFAULT NULL COMMENT '当前版本ID',
  `created_by` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '创建人账号',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_scale_code` (`scale_code`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='心理测评量表表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assessment_scale`
--

LOCK TABLES `assessment_scale` WRITE;
/*!40000 ALTER TABLE `assessment_scale` DISABLE KEYS */;
INSERT INTO `assessment_scale` VALUES (4,'K10','K10 心理困扰量表','distress','10题总体心理困扰筛查',10,10,50,0,1,2,'system','2026-03-15 02:29:57','2026-03-25 15:41:21'),(14,'WHO5','WHO-5 幸福感指数','wellbeing','5题快速幸福感/心理状态筛查',5,0,25,1,0,4,'system','2026-03-15 02:29:57','2026-03-24 16:15:45'),(15,'PHQ9','PHQ-9 抑郁筛查','depression','9题抑郁症状筛查',9,0,27,1,0,3,'system','2026-03-15 02:29:57','2026-03-24 16:15:45'),(16,'GAD7','GAD-7 焦虑筛查','anxiety','7题焦虑症状筛查',6,0,22,1,0,12,'system','2026-03-15 02:29:57','2026-03-24 17:04:05'),(17,'HAMA-14','汉密尔顿焦虑量表','anxious','测量是否焦虑',14,0,56,0,1,9,'admin','2026-03-24 16:22:00','2026-03-24 17:01:24'),(18,'HAMD-14','HAMD焦虑','anxious','汉密尔顿焦虑测试',14,0,56,1,0,10,'admin','2026-03-24 17:02:40','2026-03-24 17:02:40');
/*!40000 ALTER TABLE `assessment_scale` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `assessment_scale_version`
--

DROP TABLE IF EXISTS `assessment_scale_version`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `assessment_scale_version` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `scale_id` bigint NOT NULL COMMENT '所属量表ID',
  `version_no` int NOT NULL COMMENT '版本号，从1开始',
  `version_status` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'ACTIVE' COMMENT 'ACTIVE启用 INACTIVE停用',
  `source_question_file_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '题目Excel文件名',
  `source_rule_file_name` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '规则Excel文件名',
  `version_remark` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '版本备注',
  `created_by` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '创建人',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_scale_version_no` (`scale_id`,`version_no`),
  KEY `idx_scale_version_scale_id` (`scale_id`),
  CONSTRAINT `fk_scale_version_scale` FOREIGN KEY (`scale_id`) REFERENCES `assessment_scale` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='量表版本表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assessment_scale_version`
--

LOCK TABLES `assessment_scale_version` WRITE;
/*!40000 ALTER TABLE `assessment_scale_version` DISABLE KEYS */;
INSERT INTO `assessment_scale_version` VALUES (1,16,1,'ACTIVE',NULL,NULL,'旧量表迁移初始化V1','system','2026-03-24 16:15:45','2026-03-24 16:15:45'),(2,4,1,'INACTIVE',NULL,NULL,'旧量表迁移初始化V1','system','2026-03-24 16:15:45','2026-03-25 15:41:22'),(3,15,1,'ACTIVE',NULL,NULL,'旧量表迁移初始化V1','system','2026-03-24 16:15:45','2026-03-24 16:15:45'),(4,14,1,'ACTIVE',NULL,NULL,'旧量表迁移初始化V1','system','2026-03-24 16:15:45','2026-03-24 16:15:45'),(8,17,1,'ACTIVE','汉密尔顿焦虑量表 HAMA-14.xlsx','焦虑等级评估表汉密尔顿焦虑量表（HAMA-14）评分判定表.xlsx','首次导入','admin','2026-03-24 16:22:00','2026-03-24 16:22:00'),(9,17,2,'INACTIVE',NULL,NULL,'管理员修改版本','admin','2026-03-24 16:54:14','2026-03-24 17:01:24'),(10,18,1,'ACTIVE','汉密尔顿焦虑量表 HAMA-14.xlsx','焦虑等级评估表汉密尔顿焦虑量表（HAMA-14）评分判定表.xlsx','首次导入','admin','2026-03-24 17:02:40','2026-03-24 17:02:40'),(11,16,2,'ACTIVE',NULL,NULL,'管理员修改版本','admin','2026-03-24 17:03:11','2026-03-24 17:03:11'),(12,16,3,'ACTIVE',NULL,NULL,'管理员修改版本','admin','2026-03-24 17:04:05','2026-03-24 17:04:05');
/*!40000 ALTER TABLE `assessment_scale_version` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `assessment_version_option`
--

DROP TABLE IF EXISTS `assessment_version_option`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `assessment_version_option` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `version_question_id` bigint NOT NULL COMMENT '版本题目ID',
  `option_no` int NOT NULL COMMENT '选项序号',
  `option_text` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '选项内容',
  `option_score` int NOT NULL COMMENT '选项分值',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_version_option_no` (`version_question_id`,`option_no`),
  KEY `idx_version_option_question_id` (`version_question_id`),
  CONSTRAINT `fk_version_option_question` FOREIGN KEY (`version_question_id`) REFERENCES `assessment_version_question` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=514 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='量表版本选项表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assessment_version_option`
--

LOCK TABLES `assessment_version_option` WRITE;
/*!40000 ALTER TABLE `assessment_version_option` DISABLE KEYS */;
INSERT INTO `assessment_version_option` VALUES (1,1,1,'从不',1,'2026-03-15 02:29:57'),(2,1,2,'偶尔',2,'2026-03-15 02:29:57'),(3,1,3,'有时',3,'2026-03-15 02:29:57'),(4,1,4,'经常',4,'2026-03-15 02:29:57'),(5,1,5,'总是',5,'2026-03-15 02:29:57'),(6,2,1,'从不',1,'2026-03-15 02:29:57'),(7,2,2,'偶尔',2,'2026-03-15 02:29:57'),(8,2,3,'有时',3,'2026-03-15 02:29:57'),(9,2,4,'经常',4,'2026-03-15 02:29:57'),(10,2,5,'总是',5,'2026-03-15 02:29:57'),(11,3,1,'从不',1,'2026-03-15 02:29:57'),(12,3,2,'偶尔',2,'2026-03-15 02:29:57'),(13,3,3,'有时',3,'2026-03-15 02:29:57'),(14,3,4,'经常',4,'2026-03-15 02:29:57'),(15,3,5,'总是',5,'2026-03-15 02:29:57'),(16,4,1,'从不',1,'2026-03-15 02:29:57'),(17,4,2,'偶尔',2,'2026-03-15 02:29:57'),(18,4,3,'有时',3,'2026-03-15 02:29:57'),(19,4,4,'经常',4,'2026-03-15 02:29:57'),(20,4,5,'总是',5,'2026-03-15 02:29:57'),(21,5,1,'从不',1,'2026-03-15 02:29:57'),(22,5,2,'偶尔',2,'2026-03-15 02:29:57'),(23,5,3,'有时',3,'2026-03-15 02:29:57'),(24,5,4,'经常',4,'2026-03-15 02:29:57'),(25,5,5,'总是',5,'2026-03-15 02:29:57'),(26,6,1,'从不',1,'2026-03-15 02:29:57'),(27,6,2,'偶尔',2,'2026-03-15 02:29:57'),(28,6,3,'有时',3,'2026-03-15 02:29:57'),(29,6,4,'经常',4,'2026-03-15 02:29:57'),(30,6,5,'总是',5,'2026-03-15 02:29:57'),(31,7,1,'从不',1,'2026-03-15 02:29:57'),(32,7,2,'偶尔',2,'2026-03-15 02:29:57'),(33,7,3,'有时',3,'2026-03-15 02:29:57'),(34,7,4,'经常',4,'2026-03-15 02:29:57'),(35,7,5,'总是',5,'2026-03-15 02:29:57'),(36,8,1,'从不',1,'2026-03-15 02:29:57'),(37,8,2,'偶尔',2,'2026-03-15 02:29:57'),(38,8,3,'有时',3,'2026-03-15 02:29:57'),(39,8,4,'经常',4,'2026-03-15 02:29:57'),(40,8,5,'总是',5,'2026-03-15 02:29:57'),(41,9,1,'从不',1,'2026-03-15 02:29:57'),(42,9,2,'偶尔',2,'2026-03-15 02:29:57'),(43,9,3,'有时',3,'2026-03-15 02:29:57'),(44,9,4,'经常',4,'2026-03-15 02:29:57'),(45,9,5,'总是',5,'2026-03-15 02:29:57'),(46,10,1,'从不',1,'2026-03-15 02:29:57'),(47,10,2,'偶尔',2,'2026-03-15 02:29:57'),(48,10,3,'有时',3,'2026-03-15 02:29:57'),(49,10,4,'经常',4,'2026-03-15 02:29:57'),(50,10,5,'总是',5,'2026-03-15 02:29:57'),(51,11,1,'从未',0,'2026-03-15 02:29:57'),(52,11,2,'偶尔',1,'2026-03-15 02:29:57'),(53,11,3,'少于一半时间',2,'2026-03-15 02:29:57'),(54,11,4,'超过一半时间',3,'2026-03-15 02:29:57'),(55,11,5,'大部分时间',4,'2026-03-15 02:29:57'),(56,11,6,'一直如此',5,'2026-03-15 02:29:57'),(57,12,1,'从未',0,'2026-03-15 02:29:57'),(58,12,2,'偶尔',1,'2026-03-15 02:29:57'),(59,12,3,'少于一半时间',2,'2026-03-15 02:29:57'),(60,12,4,'超过一半时间',3,'2026-03-15 02:29:57'),(61,12,5,'大部分时间',4,'2026-03-15 02:29:57'),(62,12,6,'一直如此',5,'2026-03-15 02:29:57'),(63,13,1,'从未',0,'2026-03-15 02:29:57'),(64,13,2,'偶尔',1,'2026-03-15 02:29:57'),(65,13,3,'少于一半时间',2,'2026-03-15 02:29:57'),(66,13,4,'超过一半时间',3,'2026-03-15 02:29:57'),(67,13,5,'大部分时间',4,'2026-03-15 02:29:57'),(68,13,6,'一直如此',5,'2026-03-15 02:29:57'),(69,14,1,'从未',0,'2026-03-15 02:29:57'),(70,14,2,'偶尔',1,'2026-03-15 02:29:57'),(71,14,3,'少于一半时间',2,'2026-03-15 02:29:57'),(72,14,4,'超过一半时间',3,'2026-03-15 02:29:57'),(73,14,5,'大部分时间',4,'2026-03-15 02:29:57'),(74,14,6,'一直如此',5,'2026-03-15 02:29:57'),(75,15,1,'从未',0,'2026-03-15 02:29:57'),(76,15,2,'偶尔',1,'2026-03-15 02:29:57'),(77,15,3,'少于一半时间',2,'2026-03-15 02:29:57'),(78,15,4,'超过一半时间',3,'2026-03-15 02:29:57'),(79,15,5,'大部分时间',4,'2026-03-15 02:29:57'),(80,15,6,'一直如此',5,'2026-03-15 02:29:57'),(81,16,1,'完全没有',0,'2026-03-15 02:29:57'),(82,16,2,'几天',1,'2026-03-15 02:29:57'),(83,16,3,'一半以上天数',2,'2026-03-15 02:29:57'),(84,16,4,'几乎每天',3,'2026-03-15 02:29:57'),(85,17,1,'完全没有',0,'2026-03-15 02:29:57'),(86,17,2,'几天',1,'2026-03-15 02:29:57'),(87,17,3,'一半以上天数',2,'2026-03-15 02:29:57'),(88,17,4,'几乎每天',3,'2026-03-15 02:29:57'),(89,18,1,'完全没有',0,'2026-03-15 02:29:57'),(90,18,2,'几天',1,'2026-03-15 02:29:57'),(91,18,3,'一半以上天数',2,'2026-03-15 02:29:57'),(92,18,4,'几乎每天',3,'2026-03-15 02:29:57'),(93,19,1,'完全没有',0,'2026-03-15 02:29:57'),(94,19,2,'几天',1,'2026-03-15 02:29:57'),(95,19,3,'一半以上天数',2,'2026-03-15 02:29:57'),(96,19,4,'几乎每天',3,'2026-03-15 02:29:57'),(97,20,1,'完全没有',0,'2026-03-15 02:29:57'),(98,20,2,'几天',1,'2026-03-15 02:29:57'),(99,20,3,'一半以上天数',2,'2026-03-15 02:29:57'),(100,20,4,'几乎每天',3,'2026-03-15 02:29:57'),(101,21,1,'完全没有',0,'2026-03-15 02:29:57'),(102,21,2,'几天',1,'2026-03-15 02:29:57'),(103,21,3,'一半以上天数',2,'2026-03-15 02:29:57'),(104,21,4,'几乎每天',3,'2026-03-15 02:29:57'),(105,22,1,'完全没有',0,'2026-03-15 02:29:57'),(106,22,2,'几天',1,'2026-03-15 02:29:57'),(107,22,3,'一半以上天数',2,'2026-03-15 02:29:57'),(108,22,4,'几乎每天',3,'2026-03-15 02:29:57'),(109,23,1,'完全没有',0,'2026-03-15 02:29:57'),(110,23,2,'几天',1,'2026-03-15 02:29:57'),(111,23,3,'一半以上天数',2,'2026-03-15 02:29:57'),(112,23,4,'几乎每天',3,'2026-03-15 02:29:57'),(113,24,1,'完全没有',0,'2026-03-15 02:29:57'),(114,24,2,'几天',1,'2026-03-15 02:29:57'),(115,24,3,'一半以上天数',2,'2026-03-15 02:29:57'),(116,24,4,'几乎每天',3,'2026-03-15 02:29:57'),(117,25,1,'完全没有',0,'2026-03-15 02:29:57'),(118,25,2,'几天',1,'2026-03-15 02:29:57'),(119,25,3,'一半以上天数',2,'2026-03-15 02:29:57'),(120,25,4,'几乎每天',3,'2026-03-15 02:29:57'),(121,26,1,'完全没有',0,'2026-03-15 02:29:57'),(122,26,2,'几天',1,'2026-03-15 02:29:57'),(123,26,3,'一半以上天数',2,'2026-03-15 02:29:57'),(124,26,4,'几乎每天',3,'2026-03-15 02:29:57'),(125,27,1,'完全没有',0,'2026-03-15 02:29:57'),(126,27,2,'几天',1,'2026-03-15 02:29:57'),(127,27,3,'一半以上天数',2,'2026-03-15 02:29:57'),(128,27,4,'几乎每天',3,'2026-03-15 02:29:57'),(129,28,1,'完全没有',0,'2026-03-15 02:29:57'),(130,28,2,'几天',1,'2026-03-15 02:29:57'),(131,28,3,'一半以上天数',2,'2026-03-15 02:29:57'),(132,28,4,'几乎每天',3,'2026-03-15 02:29:57'),(133,29,1,'完全没有',0,'2026-03-15 02:29:57'),(134,29,2,'几天',1,'2026-03-15 02:29:57'),(135,29,3,'一半以上天数',2,'2026-03-15 02:29:57'),(136,29,4,'几乎每天',3,'2026-03-15 02:29:57'),(137,30,1,'完全没有',0,'2026-03-15 02:29:57'),(138,30,2,'几天',1,'2026-03-15 02:29:57'),(139,30,3,'一半以上天数',2,'2026-03-15 02:29:57'),(140,30,4,'几乎每天',3,'2026-03-15 02:29:57'),(141,31,1,'完全没有',0,'2026-03-15 02:29:57'),(142,31,2,'几天',1,'2026-03-15 02:29:57'),(143,31,3,'一半以上天数',2,'2026-03-15 02:29:57'),(144,31,4,'几乎每天',3,'2026-03-15 02:29:57'),(256,32,1,'无',0,'2026-03-24 16:22:00'),(257,32,2,'轻度紧张担忧',1,'2026-03-24 16:22:00'),(258,32,3,'明显担忧、害怕',2,'2026-03-24 16:22:00'),(259,32,4,'恐惧不安',3,'2026-03-24 16:22:00'),(260,32,5,'惊恐、濒死感',4,'2026-03-24 16:22:00'),(261,33,1,'无',0,'2026-03-24 16:22:00'),(262,33,2,'肌肉紧张',1,'2026-03-24 16:22:00'),(263,33,3,'坐立不安',2,'2026-03-24 16:22:00'),(264,33,4,'发抖、无法放松',3,'2026-03-24 16:22:00'),(265,33,5,'极度紧张失控',4,'2026-03-24 16:22:00'),(266,34,1,'无',0,'2026-03-24 16:22:00'),(267,34,2,'怕黑暗、陌生人',1,'2026-03-24 16:22:00'),(268,34,3,'怕独处、外出',2,'2026-03-24 16:22:00'),(269,34,4,'恐惧发作',3,'2026-03-24 16:22:00'),(270,34,5,'严重恐惧',4,'2026-03-24 16:22:00'),(271,35,1,'无',0,'2026-03-24 16:22:00'),(272,35,2,'入睡困难',1,'2026-03-24 16:22:00'),(273,35,3,'易醒、多梦',2,'2026-03-24 16:22:00'),(274,35,4,'早醒、睡眠差',3,'2026-03-24 16:22:00'),(275,35,5,'彻夜不眠',4,'2026-03-24 16:22:00'),(276,36,1,'无',0,'2026-03-24 16:22:00'),(277,36,2,'注意力不集中',1,'2026-03-24 16:22:00'),(278,36,3,'记忆力下降',2,'2026-03-24 16:22:00'),(279,36,4,'思维混乱',3,'2026-03-24 16:22:00'),(280,36,5,'严重认知障碍',4,'2026-03-24 16:22:00'),(281,37,1,'无',0,'2026-03-24 16:22:00'),(282,37,2,'情绪低落',1,'2026-03-24 16:22:00'),(283,37,3,'明显抑郁',2,'2026-03-24 16:22:00'),(284,37,4,'兴趣丧失',3,'2026-03-24 16:22:00'),(285,37,5,'严重抑郁',4,'2026-03-24 16:22:00'),(286,38,1,'无',0,'2026-03-24 16:22:00'),(287,38,2,'肌肉酸痛',1,'2026-03-24 16:22:00'),(288,38,3,'僵硬、震颤',2,'2026-03-24 16:22:00'),(289,38,4,'肌痉挛',3,'2026-03-24 16:22:00'),(290,38,5,'严重肌肉症状',4,'2026-03-24 16:22:00'),(291,39,1,'无',0,'2026-03-24 16:22:00'),(292,39,2,'头晕、耳鸣',1,'2026-03-24 16:22:00'),(293,39,3,'视物模糊、刺痛',2,'2026-03-24 16:22:00'),(294,39,4,'明显感觉异常',3,'2026-03-24 16:22:00'),(295,39,5,'严重障碍',4,'2026-03-24 16:22:00'),(296,40,1,'无',0,'2026-03-24 16:22:00'),(297,40,2,'心悸',1,'2026-03-24 16:22:00'),(298,40,3,'胸闷',2,'2026-03-24 16:22:00'),(299,40,4,'心动过速',3,'2026-03-24 16:22:00'),(300,40,5,'胸痛、血压波动',4,'2026-03-24 16:22:00'),(301,41,1,'无',0,'2026-03-24 16:22:00'),(302,41,2,'胸闷气短',1,'2026-03-24 16:22:00'),(303,41,3,'叹气、不畅',2,'2026-03-24 16:22:00'),(304,41,4,'窒息感',3,'2026-03-24 16:22:00'),(305,41,5,'过度换气',4,'2026-03-24 16:22:00'),(306,42,1,'无',0,'2026-03-24 16:22:00'),(307,42,2,'口干、腹胀',1,'2026-03-24 16:22:00'),(308,42,3,'恶心、嗳气',2,'2026-03-24 16:22:00'),(309,42,4,'腹泻、腹痛',3,'2026-03-24 16:22:00'),(310,42,5,'呕吐、吞咽困难',4,'2026-03-24 16:22:00'),(311,43,1,'无',0,'2026-03-24 16:22:00'),(312,43,2,'尿频',1,'2026-03-24 16:22:00'),(313,43,3,'尿急',2,'2026-03-24 16:22:00'),(314,43,4,'月经紊乱、性欲减退',3,'2026-03-24 16:22:00'),(315,43,5,'严重不适',4,'2026-03-24 16:22:00'),(316,44,1,'无',0,'2026-03-24 16:22:00'),(317,44,2,'出汗、脸红',1,'2026-03-24 16:22:00'),(318,44,3,'口干、手抖',2,'2026-03-24 16:22:00'),(319,44,4,'大汗、寒战',3,'2026-03-24 16:22:00'),(320,44,5,'严重紊乱',4,'2026-03-24 16:22:00'),(321,45,1,'正常',0,'2026-03-24 16:22:00'),(322,45,2,'轻微紧张',1,'2026-03-24 16:22:00'),(323,45,3,'坐立不安、发抖',2,'2026-03-24 16:22:00'),(324,45,4,'激动、语速快',3,'2026-03-24 16:22:00'),(325,45,5,'无法配合',4,'2026-03-24 16:22:00'),(326,46,1,'无',0,'2026-03-24 16:54:14'),(327,46,2,'轻度紧张担忧',1,'2026-03-24 16:54:14'),(328,46,3,'明显担忧、害怕',2,'2026-03-24 16:54:14'),(329,46,4,'恐惧不安',3,'2026-03-24 16:54:14'),(330,46,5,'惊恐、濒死感',4,'2026-03-24 16:54:14'),(331,47,1,'无',0,'2026-03-24 16:54:14'),(332,47,2,'肌肉紧张',1,'2026-03-24 16:54:14'),(333,47,3,'坐立不安',2,'2026-03-24 16:54:14'),(334,47,4,'发抖、无法放松',3,'2026-03-24 16:54:14'),(335,47,5,'极度紧张失控',4,'2026-03-24 16:54:14'),(336,48,1,'无',0,'2026-03-24 16:54:14'),(337,48,2,'怕黑暗、陌生人',1,'2026-03-24 16:54:14'),(338,48,3,'怕独处、外出',2,'2026-03-24 16:54:14'),(339,48,4,'恐惧发作',3,'2026-03-24 16:54:14'),(340,48,5,'严重恐惧',4,'2026-03-24 16:54:14'),(341,49,1,'无',0,'2026-03-24 16:54:14'),(342,49,2,'入睡困难',1,'2026-03-24 16:54:14'),(343,49,3,'易醒、多梦',2,'2026-03-24 16:54:14'),(344,49,4,'早醒、睡眠差',3,'2026-03-24 16:54:14'),(345,49,5,'彻夜不眠',4,'2026-03-24 16:54:14'),(346,50,1,'无',0,'2026-03-24 16:54:14'),(347,50,2,'注意力不集中',1,'2026-03-24 16:54:14'),(348,50,3,'记忆力下降',2,'2026-03-24 16:54:14'),(349,50,4,'思维混乱',3,'2026-03-24 16:54:14'),(350,50,5,'严重认知障碍',4,'2026-03-24 16:54:14'),(351,51,1,'无',0,'2026-03-24 16:54:14'),(352,51,2,'情绪低落',1,'2026-03-24 16:54:14'),(353,51,3,'明显抑郁',2,'2026-03-24 16:54:14'),(354,51,4,'兴趣丧失',3,'2026-03-24 16:54:14'),(355,51,5,'严重抑郁',4,'2026-03-24 16:54:14'),(356,52,1,'无',0,'2026-03-24 16:54:14'),(357,52,2,'肌肉酸痛',1,'2026-03-24 16:54:14'),(358,52,3,'僵硬、震颤',2,'2026-03-24 16:54:14'),(359,52,4,'肌痉挛',3,'2026-03-24 16:54:14'),(360,52,5,'严重肌肉症状',4,'2026-03-24 16:54:14'),(361,53,1,'无',0,'2026-03-24 16:54:14'),(362,53,2,'头晕、耳鸣',1,'2026-03-24 16:54:14'),(363,53,3,'视物模糊、刺痛',2,'2026-03-24 16:54:14'),(364,53,4,'明显感觉异常',3,'2026-03-24 16:54:14'),(365,53,5,'严重障碍',4,'2026-03-24 16:54:14'),(366,54,1,'无',0,'2026-03-24 16:54:14'),(367,54,2,'心悸',1,'2026-03-24 16:54:14'),(368,54,3,'胸闷',2,'2026-03-24 16:54:14'),(369,54,4,'心动过速',3,'2026-03-24 16:54:14'),(370,54,5,'胸痛、血压波动',4,'2026-03-24 16:54:14'),(371,55,1,'无',0,'2026-03-24 16:54:14'),(372,55,2,'胸闷气短',1,'2026-03-24 16:54:14'),(373,55,3,'叹气、不畅',2,'2026-03-24 16:54:14'),(374,55,4,'窒息感',3,'2026-03-24 16:54:14'),(375,55,5,'过度换气',4,'2026-03-24 16:54:14'),(376,56,1,'无',0,'2026-03-24 16:54:14'),(377,56,2,'口干、腹胀',1,'2026-03-24 16:54:14'),(378,56,3,'恶心、嗳气',2,'2026-03-24 16:54:14'),(379,56,4,'腹泻、腹痛',3,'2026-03-24 16:54:14'),(380,56,5,'呕吐、吞咽困难',4,'2026-03-24 16:54:14'),(381,57,1,'无',0,'2026-03-24 16:54:14'),(382,57,2,'尿频',1,'2026-03-24 16:54:14'),(383,57,3,'尿急',2,'2026-03-24 16:54:14'),(384,57,4,'月经紊乱、性欲减退',3,'2026-03-24 16:54:14'),(385,57,5,'严重不适',4,'2026-03-24 16:54:14'),(386,58,1,'无',0,'2026-03-24 16:54:14'),(387,58,2,'出汗、脸红',1,'2026-03-24 16:54:14'),(388,58,3,'口干、手抖',2,'2026-03-24 16:54:14'),(389,58,4,'大汗、寒战',3,'2026-03-24 16:54:14'),(390,58,5,'严重紊乱',4,'2026-03-24 16:54:14'),(391,59,1,'正常',0,'2026-03-24 16:54:14'),(392,59,2,'轻微紧张',1,'2026-03-24 16:54:14'),(393,59,3,'坐立不安、发抖',2,'2026-03-24 16:54:14'),(394,59,4,'激动、语速快',3,'2026-03-24 16:54:14'),(395,59,5,'无法配合',4,'2026-03-24 16:54:14'),(396,60,1,'无',0,'2026-03-24 17:02:40'),(397,60,2,'轻度紧张担忧',1,'2026-03-24 17:02:40'),(398,60,3,'明显担忧、害怕',2,'2026-03-24 17:02:40'),(399,60,4,'恐惧不安',3,'2026-03-24 17:02:40'),(400,60,5,'惊恐、濒死感',4,'2026-03-24 17:02:40'),(401,61,1,'无',0,'2026-03-24 17:02:40'),(402,61,2,'肌肉紧张',1,'2026-03-24 17:02:40'),(403,61,3,'坐立不安',2,'2026-03-24 17:02:40'),(404,61,4,'发抖、无法放松',3,'2026-03-24 17:02:40'),(405,61,5,'极度紧张失控',4,'2026-03-24 17:02:40'),(406,62,1,'无',0,'2026-03-24 17:02:40'),(407,62,2,'怕黑暗、陌生人',1,'2026-03-24 17:02:40'),(408,62,3,'怕独处、外出',2,'2026-03-24 17:02:40'),(409,62,4,'恐惧发作',3,'2026-03-24 17:02:40'),(410,62,5,'严重恐惧',4,'2026-03-24 17:02:40'),(411,63,1,'无',0,'2026-03-24 17:02:40'),(412,63,2,'入睡困难',1,'2026-03-24 17:02:40'),(413,63,3,'易醒、多梦',2,'2026-03-24 17:02:40'),(414,63,4,'早醒、睡眠差',3,'2026-03-24 17:02:40'),(415,63,5,'彻夜不眠',4,'2026-03-24 17:02:40'),(416,64,1,'无',0,'2026-03-24 17:02:40'),(417,64,2,'注意力不集中',1,'2026-03-24 17:02:40'),(418,64,3,'记忆力下降',2,'2026-03-24 17:02:40'),(419,64,4,'思维混乱',3,'2026-03-24 17:02:40'),(420,64,5,'严重认知障碍',4,'2026-03-24 17:02:40'),(421,65,1,'无',0,'2026-03-24 17:02:40'),(422,65,2,'情绪低落',1,'2026-03-24 17:02:40'),(423,65,3,'明显抑郁',2,'2026-03-24 17:02:40'),(424,65,4,'兴趣丧失',3,'2026-03-24 17:02:40'),(425,65,5,'严重抑郁',4,'2026-03-24 17:02:40'),(426,66,1,'无',0,'2026-03-24 17:02:40'),(427,66,2,'肌肉酸痛',1,'2026-03-24 17:02:40'),(428,66,3,'僵硬、震颤',2,'2026-03-24 17:02:40'),(429,66,4,'肌痉挛',3,'2026-03-24 17:02:40'),(430,66,5,'严重肌肉症状',4,'2026-03-24 17:02:40'),(431,67,1,'无',0,'2026-03-24 17:02:40'),(432,67,2,'头晕、耳鸣',1,'2026-03-24 17:02:40'),(433,67,3,'视物模糊、刺痛',2,'2026-03-24 17:02:40'),(434,67,4,'明显感觉异常',3,'2026-03-24 17:02:40'),(435,67,5,'严重障碍',4,'2026-03-24 17:02:40'),(436,68,1,'无',0,'2026-03-24 17:02:40'),(437,68,2,'心悸',1,'2026-03-24 17:02:40'),(438,68,3,'胸闷',2,'2026-03-24 17:02:40'),(439,68,4,'心动过速',3,'2026-03-24 17:02:40'),(440,68,5,'胸痛、血压波动',4,'2026-03-24 17:02:40'),(441,69,1,'无',0,'2026-03-24 17:02:40'),(442,69,2,'胸闷气短',1,'2026-03-24 17:02:40'),(443,69,3,'叹气、不畅',2,'2026-03-24 17:02:40'),(444,69,4,'窒息感',3,'2026-03-24 17:02:40'),(445,69,5,'过度换气',4,'2026-03-24 17:02:40'),(446,70,1,'无',0,'2026-03-24 17:02:40'),(447,70,2,'口干、腹胀',1,'2026-03-24 17:02:40'),(448,70,3,'恶心、嗳气',2,'2026-03-24 17:02:40'),(449,70,4,'腹泻、腹痛',3,'2026-03-24 17:02:40'),(450,70,5,'呕吐、吞咽困难',4,'2026-03-24 17:02:40'),(451,71,1,'无',0,'2026-03-24 17:02:40'),(452,71,2,'尿频',1,'2026-03-24 17:02:40'),(453,71,3,'尿急',2,'2026-03-24 17:02:40'),(454,71,4,'月经紊乱、性欲减退',3,'2026-03-24 17:02:40'),(455,71,5,'严重不适',4,'2026-03-24 17:02:40'),(456,72,1,'无',0,'2026-03-24 17:02:40'),(457,72,2,'出汗、脸红',1,'2026-03-24 17:02:40'),(458,72,3,'口干、手抖',2,'2026-03-24 17:02:40'),(459,72,4,'大汗、寒战',3,'2026-03-24 17:02:40'),(460,72,5,'严重紊乱',4,'2026-03-24 17:02:40'),(461,73,1,'正常',0,'2026-03-24 17:02:40'),(462,73,2,'轻微紧张',1,'2026-03-24 17:02:40'),(463,73,3,'坐立不安、发抖',2,'2026-03-24 17:02:40'),(464,73,4,'激动、语速快',3,'2026-03-24 17:02:40'),(465,73,5,'无法配合',4,'2026-03-24 17:02:40'),(466,74,1,'完全没有',0,'2026-03-24 17:03:11'),(467,74,2,'几天',1,'2026-03-24 17:03:11'),(468,74,3,'一半以上天数',2,'2026-03-24 17:03:11'),(469,74,4,'几乎每天',3,'2026-03-24 17:03:11'),(470,75,1,'完全没有',0,'2026-03-24 17:03:11'),(471,75,2,'几天',1,'2026-03-24 17:03:11'),(472,75,3,'一半以上天数',2,'2026-03-24 17:03:11'),(473,75,4,'几乎每天',3,'2026-03-24 17:03:11'),(474,76,1,'完全没有',0,'2026-03-24 17:03:11'),(475,76,2,'几天',1,'2026-03-24 17:03:11'),(476,76,3,'一半以上天数',2,'2026-03-24 17:03:11'),(477,76,4,'几乎每天',3,'2026-03-24 17:03:11'),(478,77,1,'完全没有',0,'2026-03-24 17:03:11'),(479,77,2,'几天',1,'2026-03-24 17:03:11'),(480,77,3,'一半以上天数',2,'2026-03-24 17:03:11'),(481,77,4,'几乎每天',3,'2026-03-24 17:03:11'),(482,78,1,'完全没有',0,'2026-03-24 17:03:11'),(483,78,2,'几天',1,'2026-03-24 17:03:11'),(484,78,3,'一半以上天数',2,'2026-03-24 17:03:11'),(485,78,4,'几乎每天',3,'2026-03-24 17:03:11'),(486,79,1,'完全没有',0,'2026-03-24 17:03:11'),(487,79,2,'几天',1,'2026-03-24 17:03:11'),(488,79,3,'一半以上天数',2,'2026-03-24 17:03:11'),(489,79,4,'几乎每天',3,'2026-03-24 17:03:11'),(490,80,1,'完全没有',0,'2026-03-24 17:04:05'),(491,80,2,'几天',1,'2026-03-24 17:04:05'),(492,80,3,'一半以上天数',2,'2026-03-24 17:04:05'),(493,80,4,'几乎每天',3,'2026-03-24 17:04:05'),(494,81,1,'完全没有',0,'2026-03-24 17:04:05'),(495,81,2,'几天',1,'2026-03-24 17:04:05'),(496,81,3,'一半以上天数',2,'2026-03-24 17:04:05'),(497,81,4,'几乎每天',3,'2026-03-24 17:04:05'),(498,82,1,'完全没有',0,'2026-03-24 17:04:05'),(499,82,2,'几天',1,'2026-03-24 17:04:05'),(500,82,3,'一半以上天数',2,'2026-03-24 17:04:05'),(501,82,4,'几乎每天',3,'2026-03-24 17:04:05'),(502,83,1,'完全没有',0,'2026-03-24 17:04:05'),(503,83,2,'几天',1,'2026-03-24 17:04:05'),(504,83,3,'一半以上天数',2,'2026-03-24 17:04:05'),(505,83,4,'几乎每天',3,'2026-03-24 17:04:05'),(506,84,1,'完全没有',0,'2026-03-24 17:04:05'),(507,84,2,'几天',1,'2026-03-24 17:04:05'),(508,84,3,'一半以上天数',2,'2026-03-24 17:04:05'),(509,84,4,'几乎每天',3,'2026-03-24 17:04:05'),(510,85,1,'完全没有',0,'2026-03-24 17:04:05'),(511,85,2,'几天',1,'2026-03-24 17:04:05'),(512,85,3,'一半以上天数',2,'2026-03-24 17:04:05'),(513,85,4,'几乎每天',3,'2026-03-24 17:04:05');
/*!40000 ALTER TABLE `assessment_version_option` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `assessment_version_question`
--

DROP TABLE IF EXISTS `assessment_version_question`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `assessment_version_question` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `version_id` bigint NOT NULL COMMENT '版本ID',
  `question_no` int NOT NULL COMMENT '题号',
  `question_text` varchar(500) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '题目内容',
  `required_flag` tinyint NOT NULL DEFAULT '1' COMMENT '是否必答',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_version_question_no` (`version_id`,`question_no`),
  KEY `idx_version_question_version_id` (`version_id`),
  CONSTRAINT `fk_version_question_version` FOREIGN KEY (`version_id`) REFERENCES `assessment_scale_version` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=86 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='量表版本题目表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assessment_version_question`
--

LOCK TABLES `assessment_version_question` WRITE;
/*!40000 ALTER TABLE `assessment_version_question` DISABLE KEYS */;
INSERT INTO `assessment_version_question` VALUES (1,2,1,'过去30天里，你是否无明显原因地感到疲惫？',1,'2026-03-15 02:29:57'),(2,2,2,'过去30天里，你是否感到紧张？',1,'2026-03-15 02:29:57'),(3,2,3,'过去30天里，你是否紧张到难以平静下来？',1,'2026-03-15 02:29:57'),(4,2,4,'过去30天里，你是否感到没有希望？',1,'2026-03-15 02:29:57'),(5,2,5,'过去30天里，你是否感到坐立不安或心烦意乱？',1,'2026-03-15 02:29:57'),(6,2,6,'过去30天里，你是否坐立不安到根本坐不住？',1,'2026-03-15 02:29:57'),(7,2,7,'过去30天里，你是否感到情绪低落？',1,'2026-03-15 02:29:57'),(8,2,8,'过去30天里，你是否觉得做任何事都很费力？',1,'2026-03-15 02:29:57'),(9,2,9,'过去30天里，你是否悲伤到没有什么能让你开心起来？',1,'2026-03-15 02:29:57'),(10,2,10,'过去30天里，你是否感到自己毫无价值？',1,'2026-03-15 02:29:57'),(11,4,1,'过去两周，我感觉心情愉快、精神较好',1,'2026-03-15 02:29:57'),(12,4,2,'过去两周，我感觉平静、放松',1,'2026-03-15 02:29:57'),(13,4,3,'过去两周，我感觉精力充沛、做事有劲头',1,'2026-03-15 02:29:57'),(14,4,4,'过去两周，我起床后感觉休息充分',1,'2026-03-15 02:29:57'),(15,4,5,'过去两周，我的日常生活里有让我感兴趣的事情',1,'2026-03-15 02:29:57'),(16,3,1,'过去两周，做事兴趣下降或提不起劲',1,'2026-03-15 02:29:57'),(17,3,2,'过去两周，情绪低落、沮丧或感到无望',1,'2026-03-15 02:29:57'),(18,3,3,'过去两周，入睡困难、易醒或睡得过多',1,'2026-03-15 02:29:57'),(19,3,4,'过去两周，感到疲惫或缺乏精力',1,'2026-03-15 02:29:57'),(20,3,5,'过去两周，食欲差或吃得过多',1,'2026-03-15 02:29:57'),(21,3,6,'过去两周，对自己评价很差，觉得自己失败或让家人失望',1,'2026-03-15 02:29:57'),(22,3,7,'过去两周，难以集中注意力，如学习或阅读时难专心',1,'2026-03-15 02:29:57'),(23,3,8,'过去两周，动作或说话明显变慢，或坐立不安比平时更明显',1,'2026-03-15 02:29:57'),(24,3,9,'过去两周，出现过伤害自己或认为不如消失的想法',1,'2026-03-15 02:29:57'),(25,1,1,'过去两周，感到紧张、焦虑或神经绷得很紧',1,'2026-03-15 02:29:57'),(26,1,2,'过去两周，无法停止担忧或控制担忧',1,'2026-03-15 02:29:57'),(27,1,3,'过去两周，过度担心各种事情',1,'2026-03-15 02:29:57'),(28,1,4,'过去两周，难以放松下来',1,'2026-03-15 02:29:57'),(29,1,5,'过去两周，坐立不安，难以安静坐着',1,'2026-03-15 02:29:57'),(30,1,6,'过去两周，容易烦躁或被激怒',1,'2026-03-15 02:29:57'),(31,1,7,'过去两周，总担心会有糟糕的事情发生',1,'2026-03-15 02:29:57'),(32,8,1,'焦虑心境',1,'2026-03-24 16:22:00'),(33,8,2,'紧张感',1,'2026-03-24 16:22:00'),(34,8,3,'害怕',1,'2026-03-24 16:22:00'),(35,8,4,'失眠',1,'2026-03-24 16:22:00'),(36,8,5,'认知功能',1,'2026-03-24 16:22:00'),(37,8,6,'抑郁心境',1,'2026-03-24 16:22:00'),(38,8,7,'肌肉系统症状',1,'2026-03-24 16:22:00'),(39,8,8,'感觉系统症状',1,'2026-03-24 16:22:00'),(40,8,9,'心血管症状',1,'2026-03-24 16:22:00'),(41,8,10,'呼吸系统症状',1,'2026-03-24 16:22:00'),(42,8,11,'胃肠道症状',1,'2026-03-24 16:22:00'),(43,8,12,'泌尿生殖症状',1,'2026-03-24 16:22:00'),(44,8,13,'自主神经症状',1,'2026-03-24 16:22:00'),(45,8,14,'会谈行为表现',1,'2026-03-24 16:22:00'),(46,9,1,'焦虑心境',1,'2026-03-24 16:54:14'),(47,9,2,'紧张感',1,'2026-03-24 16:54:14'),(48,9,3,'害怕',1,'2026-03-24 16:54:14'),(49,9,4,'失眠',1,'2026-03-24 16:54:14'),(50,9,5,'认知功能',1,'2026-03-24 16:54:14'),(51,9,6,'抑郁心境',1,'2026-03-24 16:54:14'),(52,9,7,'肌肉系统症状',1,'2026-03-24 16:54:14'),(53,9,8,'感觉系统症状',1,'2026-03-24 16:54:14'),(54,9,9,'心血管症状',1,'2026-03-24 16:54:14'),(55,9,10,'呼吸系统症状',1,'2026-03-24 16:54:14'),(56,9,11,'胃肠道症状',1,'2026-03-24 16:54:14'),(57,9,12,'泌尿生殖症状',1,'2026-03-24 16:54:14'),(58,9,13,'自主神经症状',1,'2026-03-24 16:54:14'),(59,9,14,'会谈行为表现',1,'2026-03-24 16:54:14'),(60,10,1,'焦虑心境',1,'2026-03-24 17:02:40'),(61,10,2,'紧张感',1,'2026-03-24 17:02:40'),(62,10,3,'害怕',1,'2026-03-24 17:02:40'),(63,10,4,'失眠',1,'2026-03-24 17:02:40'),(64,10,5,'认知功能',1,'2026-03-24 17:02:40'),(65,10,6,'抑郁心境',1,'2026-03-24 17:02:40'),(66,10,7,'肌肉系统症状',1,'2026-03-24 17:02:40'),(67,10,8,'感觉系统症状',1,'2026-03-24 17:02:40'),(68,10,9,'心血管症状',1,'2026-03-24 17:02:40'),(69,10,10,'呼吸系统症状',1,'2026-03-24 17:02:40'),(70,10,11,'胃肠道症状',1,'2026-03-24 17:02:40'),(71,10,12,'泌尿生殖症状',1,'2026-03-24 17:02:40'),(72,10,13,'自主神经症状',1,'2026-03-24 17:02:40'),(73,10,14,'会谈行为表现',1,'2026-03-24 17:02:40'),(74,11,1,'过去两周，无法停止担忧或控制担忧',1,'2026-03-24 17:03:11'),(75,11,2,'过去两周，过度担心各种事情',1,'2026-03-24 17:03:11'),(76,11,3,'过去两周，难以放松下来',1,'2026-03-24 17:03:11'),(77,11,4,'过去两周，坐立不安，难以安静坐着',1,'2026-03-24 17:03:11'),(78,11,5,'过去两周，容易烦躁或被激怒',1,'2026-03-24 17:03:11'),(79,11,6,'过去两周，总担心会有糟糕的事情发生',1,'2026-03-24 17:03:11'),(80,12,1,'过去两周，无法停止担忧或控制担忧',1,'2026-03-24 17:04:05'),(81,12,2,'过去两周，过度担心各种事情',1,'2026-03-24 17:04:05'),(82,12,3,'过去两周，难以放松下来',1,'2026-03-24 17:04:05'),(83,12,4,'过去两周，坐立不安，难以安静坐着',1,'2026-03-24 17:04:05'),(84,12,5,'过去两周，容易烦躁或被激怒',1,'2026-03-24 17:04:05'),(85,12,6,'过去两周，总担心会有糟糕的事情发生',1,'2026-03-24 17:04:05');
/*!40000 ALTER TABLE `assessment_version_question` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `assessment_version_rule`
--

DROP TABLE IF EXISTS `assessment_version_rule`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `assessment_version_rule` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `version_id` bigint NOT NULL COMMENT '版本ID',
  `min_score` int NOT NULL COMMENT '最小分',
  `max_score` int NOT NULL COMMENT '最大分',
  `result_level` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '结果等级',
  `result_summary` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '结果说明',
  `suggestion` varchar(500) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '建议',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  KEY `idx_version_rule_version_id` (`version_id`),
  CONSTRAINT `fk_version_rule_version` FOREIGN KEY (`version_id`) REFERENCES `assessment_scale_version` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=39 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='量表版本判定规则表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `assessment_version_rule`
--

LOCK TABLES `assessment_version_rule` WRITE;
/*!40000 ALTER TABLE `assessment_version_rule` DISABLE KEYS */;
INSERT INTO `assessment_version_rule` VALUES (1,2,10,15,'低','心理困扰水平较低','建议保持当前状态','2026-03-15 02:29:57'),(2,2,16,21,'中等','存在一定心理困扰','建议关注近期压力事件，必要时复测','2026-03-15 02:29:57'),(3,2,22,29,'高','心理困扰水平较高','建议预约心理咨询','2026-03-15 02:29:57'),(4,2,30,50,'很高','心理困扰水平很高','建议尽快寻求专业帮助','2026-03-15 02:29:57'),(5,4,0,12,'较差','当前幸福感偏低，建议进一步评估情绪状态','建议继续做 PHQ-9 或联系心理老师','2026-03-15 02:29:57'),(6,4,13,25,'正常','当前幸福感总体正常','建议保持规律作息并定期复测','2026-03-15 02:29:57'),(7,3,0,4,'无或极轻','当前抑郁症状较少','建议保持规律生活并持续关注情绪变化','2026-03-15 02:29:57'),(8,3,5,9,'轻度','存在轻度抑郁倾向','建议一到两周后复测，并关注睡眠与压力','2026-03-15 02:29:57'),(9,3,10,14,'中度','存在中度抑郁风险','建议预约心理咨询或联系辅导员','2026-03-15 02:29:57'),(10,3,15,19,'中重度','抑郁风险较高','建议尽快进行专业心理评估','2026-03-15 02:29:57'),(11,3,20,27,'重度','抑郁风险高','建议尽快联系专业心理老师或医疗机构','2026-03-15 02:29:57'),(12,1,0,4,'无或极轻','当前焦虑症状较少','建议保持稳定作息和运动','2026-03-15 02:29:57'),(13,1,5,9,'轻度','存在轻度焦虑倾向','建议关注压力来源并进行自我调节','2026-03-15 02:29:57'),(14,1,10,14,'中度','存在中度焦虑风险','建议进一步咨询心理老师','2026-03-15 02:29:57'),(15,1,15,21,'重度','焦虑风险较高','建议尽快接受专业评估','2026-03-15 02:29:57'),(16,8,0,6,'无焦虑','当前无明显焦虑症状','建议保持稳定作息和运动，持续关注情绪状态','2026-03-24 16:22:00'),(17,8,7,13,'可能轻度焦虑','存在轻度焦虑倾向','建议关注压力来源，进行自我调节，定期复测','2026-03-24 16:22:00'),(18,8,14,20,'轻度焦虑','存在轻度焦虑风险','建议进一步咨询心理老师，学习情绪调节方法','2026-03-24 16:22:00'),(19,8,21,28,'中度焦虑','存在中度焦虑风险','建议预约专业心理咨询，接受系统干预','2026-03-24 16:22:00'),(20,8,29,56,'重度焦虑','焦虑风险极高','建议尽快接受专业心理评估与临床干预','2026-03-24 16:22:00'),(21,9,0,6,'无焦虑','当前无明显焦虑症状','建议保持稳定作息和运动，持续关注情绪状态','2026-03-24 16:54:14'),(22,9,7,13,'可能轻度焦虑','存在轻度焦虑倾向','建议关注压力来源，进行自我调节，定期复测','2026-03-24 16:54:14'),(23,9,14,20,'轻度焦虑','存在轻度焦虑风险','建议进一步咨询心理老师，学习情绪调节方法','2026-03-24 16:54:14'),(24,9,21,28,'中度焦虑','存在中度焦虑风险','建议预约专业心理咨询，接受系统干预','2026-03-24 16:54:14'),(25,9,29,56,'重度焦虑','焦虑风险极高','建议尽快接受专业心理评估与临床干预','2026-03-24 16:54:14'),(26,10,0,6,'无焦虑','当前无明显焦虑症状','建议保持稳定作息和运动，持续关注情绪状态','2026-03-24 17:02:40'),(27,10,7,13,'可能轻度焦虑','存在轻度焦虑倾向','建议关注压力来源，进行自我调节，定期复测','2026-03-24 17:02:40'),(28,10,14,20,'轻度焦虑','存在轻度焦虑风险','建议进一步咨询心理老师，学习情绪调节方法','2026-03-24 17:02:40'),(29,10,21,28,'中度焦虑','存在中度焦虑风险','建议预约专业心理咨询，接受系统干预','2026-03-24 17:02:40'),(30,10,29,56,'重度焦虑','焦虑风险极高','建议尽快接受专业心理评估与临床干预','2026-03-24 17:02:40'),(31,11,0,4,'无或极轻','当前焦虑症状较少','建议保持稳定作息和运动','2026-03-24 17:03:11'),(32,11,5,9,'轻度','存在轻度焦虑倾向','建议关注压力来源并进行自我调节','2026-03-24 17:03:11'),(33,11,10,14,'中度','存在中度焦虑风险','建议进一步咨询心理老师','2026-03-24 17:03:11'),(34,11,15,21,'重度','焦虑风险较高','建议尽快接受专业评估','2026-03-24 17:03:11'),(35,12,0,3,'无或极轻','当前焦虑症状较少','建议保持稳定作息和运动','2026-03-24 17:04:05'),(36,12,4,8,'轻度','存在轻度焦虑倾向','建议关注压力来源并进行自我调节','2026-03-24 17:04:05'),(37,12,11,13,'中度','存在中度焦虑风险','建议进一步咨询心理老师','2026-03-24 17:04:05'),(38,12,14,22,'重度','焦虑风险较高','建议尽快接受专业评估','2026-03-24 17:04:05');
/*!40000 ALTER TABLE `assessment_version_rule` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `counselor`
--

DROP TABLE IF EXISTS `counselor`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `counselor` (
  `account` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '账号',
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '辅导员姓名',
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '密码',
  `college` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '学院',
  `grade` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '负责年级，如2023级',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '手机号',
  `avatar_url` varchar(500) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '辅导员头像地址',
  PRIMARY KEY (`account`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='辅导员表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `counselor`
--

LOCK TABLES `counselor` WRITE;
/*!40000 ALTER TABLE `counselor` DISABLE KEYS */;
INSERT INTO `counselor` VALUES ('counselor01','李老师','counselor@01','计算机与人工智能学院','2023级','13700137001','/files/avatar/counselor/counselor01_1774590542697_988b66ff65b5.png'),('counselor02','王老师','counselor@02','文学院','2022级','13700137002',NULL),('counselor03','张老师','counselor@03','医学院','2022级','13700137003',NULL),('counselor04','赵老师','counselor@04','商学院','2023级','13700137004',NULL),('counselor05','陈老师','counselor@05','外国语学院','2023级','13700137005',NULL);
/*!40000 ALTER TABLE `counselor` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `counselor_class_mapping`
--

DROP TABLE IF EXISTS `counselor_class_mapping`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `counselor_class_mapping` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `counselor_account` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '辅导员账号',
  `class_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '班级',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_class_name` (`class_name`),
  KEY `idx_counselor_account` (`counselor_account`),
  CONSTRAINT `fk_counselor_class_mapping_account` FOREIGN KEY (`counselor_account`) REFERENCES `counselor` (`account`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='辅导员负责班级关系表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `counselor_class_mapping`
--

LOCK TABLES `counselor_class_mapping` WRITE;
/*!40000 ALTER TABLE `counselor_class_mapping` DISABLE KEYS */;
INSERT INTO `counselor_class_mapping` VALUES (1,'counselor01','软件工程2301班','2026-03-20 20:23:01','2026-03-20 20:23:01'),(2,'counselor01','软件工程2302班','2026-03-20 20:23:01','2026-03-20 20:23:01'),(3,'counselor02','汉语言文学2302班','2026-03-20 20:23:01','2026-03-20 20:23:01'),(4,'counselor03','临床医学2303班','2026-03-20 20:23:01','2026-03-20 20:23:01'),(5,'counselor04','财务管理2304班','2026-03-20 20:23:01','2026-03-20 20:23:01'),(6,'counselor05','英语2305班','2026-03-20 20:23:01','2026-03-20 20:23:01');
/*!40000 ALTER TABLE `counselor_class_mapping` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student`
--

DROP TABLE IF EXISTS `student`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student` (
  `student_id` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '学号',
  `name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '姓名',
  `college` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '学院',
  `class_name` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '班级',
  `grade` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '' COMMENT '年级，如2023级',
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '密码',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '手机号',
  `avatar_url` varchar(500) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '头像访问地址',
  PRIMARY KEY (`student_id`),
  UNIQUE KEY `uk_student_phone` (`phone`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='学生表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student`
--

LOCK TABLES `student` WRITE;
/*!40000 ALTER TABLE `student` DISABLE KEYS */;
INSERT INTO `student` VALUES ('2023010101','张三','计算机与人工智能学院','软件工程2301班','2023级','1234567','13800138001','/files/avatar/student/2023010101_1774587582688_cde5aa4a4cda.png'),('2023010102','李四','计算机与人工智能学院','软件工程2301班','2023级','123456aA!','13800138002',NULL),('2023010109','张航','计算机与人工智能学院','软件工程2303班','2023级','123456','13800138011',NULL),('2023020201','王五','文学院','汉语言文学2302班','2023级','123456aA!','13800138003',NULL),('2023020202','赵六','文学院','汉语言文学2302班','2023级','123456aA!','13800138004',NULL),('2023030301','孙七','医学院','临床医学2303班','2023级','123456aA!','13800138005',NULL),('2023030302','周八','医学院','临床医学2303班','2023级','123456aA!','13800138006',NULL),('2023040401','吴九','商学院','财务管理2304班','2023级','123456aA!','13800138007',NULL),('2023040402','郑十','商学院','财务管理2304班','2023级','123456aA!','13800138008',NULL),('2023050501','钱一','外国语学院','英语2305班','2023级','123456aA!','13800138009',NULL),('2023050502','冯二','外国语学院','英语2305班','2023级','123456aA!','13800138010',NULL);
/*!40000 ALTER TABLE `student` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student_assessment_answer`
--

DROP TABLE IF EXISTS `student_assessment_answer`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student_assessment_answer` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `record_id` bigint NOT NULL COMMENT '测评主记录ID',
  `version_question_id` bigint NOT NULL COMMENT '版本题目ID',
  `question_no` int NOT NULL COMMENT '题号快照',
  `question_text` varchar(500) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '题目内容快照',
  `version_option_id` bigint NOT NULL COMMENT '版本选项ID',
  `option_no` int NOT NULL COMMENT '选项序号快照',
  `option_text` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '选项内容快照',
  `answer_score` int NOT NULL COMMENT '该题得分',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  PRIMARY KEY (`id`),
  KEY `idx_student_assessment_answer_record_id` (`record_id`),
  KEY `idx_student_assessment_answer_question_id` (`version_question_id`),
  KEY `idx_student_assessment_answer_option_id` (`version_option_id`),
  CONSTRAINT `fk_student_assessment_answer_option` FOREIGN KEY (`version_option_id`) REFERENCES `assessment_version_option` (`id`),
  CONSTRAINT `fk_student_assessment_answer_question` FOREIGN KEY (`version_question_id`) REFERENCES `assessment_version_question` (`id`),
  CONSTRAINT `fk_student_assessment_answer_record` FOREIGN KEY (`record_id`) REFERENCES `student_assessment_record` (`id`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=139 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='学生单量表作答明细表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student_assessment_answer`
--

LOCK TABLES `student_assessment_answer` WRITE;
/*!40000 ALTER TABLE `student_assessment_answer` DISABLE KEYS */;
INSERT INTO `student_assessment_answer` VALUES (81,10,11,1,'过去两周，我感觉心情愉快、精神较好',52,2,'偶尔',1,'2026-03-25 18:25:59'),(82,10,12,2,'过去两周，我感觉平静、放松',58,2,'偶尔',1,'2026-03-25 18:25:59'),(83,10,13,3,'过去两周，我感觉精力充沛、做事有劲头',64,2,'偶尔',1,'2026-03-25 18:25:59'),(84,10,14,4,'过去两周，我起床后感觉休息充分',70,2,'偶尔',1,'2026-03-25 18:25:59'),(85,10,15,5,'过去两周，我的日常生活里有让我感兴趣的事情',76,2,'偶尔',1,'2026-03-25 18:25:59'),(86,11,16,1,'过去两周，做事兴趣下降或提不起劲',81,1,'完全没有',0,'2026-03-26 11:39:35'),(87,11,17,2,'过去两周，情绪低落、沮丧或感到无望',85,1,'完全没有',0,'2026-03-26 11:39:35'),(88,11,18,3,'过去两周，入睡困难、易醒或睡得过多',89,1,'完全没有',0,'2026-03-26 11:39:35'),(89,11,19,4,'过去两周，感到疲惫或缺乏精力',93,1,'完全没有',0,'2026-03-26 11:39:35'),(90,11,20,5,'过去两周，食欲差或吃得过多',97,1,'完全没有',0,'2026-03-26 11:39:35'),(91,11,21,6,'过去两周，对自己评价很差，觉得自己失败或让家人失望',101,1,'完全没有',0,'2026-03-26 11:39:35'),(92,11,22,7,'过去两周，难以集中注意力，如学习或阅读时难专心',105,1,'完全没有',0,'2026-03-26 11:39:35'),(93,11,23,8,'过去两周，动作或说话明显变慢，或坐立不安比平时更明显',109,1,'完全没有',0,'2026-03-26 11:39:35'),(94,11,24,9,'过去两周，出现过伤害自己或认为不如消失的想法',113,1,'完全没有',0,'2026-03-26 11:39:35'),(95,12,80,1,'过去两周，无法停止担忧或控制担忧',493,4,'几乎每天',3,'2026-03-26 11:40:55'),(96,12,81,2,'过去两周，过度担心各种事情',497,4,'几乎每天',3,'2026-03-26 11:40:55'),(97,12,82,3,'过去两周，难以放松下来',501,4,'几乎每天',3,'2026-03-26 11:40:55'),(98,12,83,4,'过去两周，坐立不安，难以安静坐着',505,4,'几乎每天',3,'2026-03-26 11:40:55'),(99,12,84,5,'过去两周，容易烦躁或被激怒',509,4,'几乎每天',3,'2026-03-26 11:40:55'),(100,12,85,6,'过去两周，总担心会有糟糕的事情发生',513,4,'几乎每天',3,'2026-03-26 11:40:55'),(115,14,11,1,'过去两周，我感觉心情愉快、精神较好',51,1,'从未',0,'2026-03-26 13:24:31'),(116,14,12,2,'过去两周，我感觉平静、放松',58,2,'偶尔',1,'2026-03-26 13:24:31'),(117,14,13,3,'过去两周，我感觉精力充沛、做事有劲头',65,3,'少于一半时间',2,'2026-03-26 13:24:31'),(118,14,14,4,'过去两周，我起床后感觉休息充分',72,4,'超过一半时间',3,'2026-03-26 13:24:31'),(119,14,15,5,'过去两周，我的日常生活里有让我感兴趣的事情',78,4,'超过一半时间',3,'2026-03-26 13:24:31'),(120,15,11,1,'过去两周，我感觉心情愉快、精神较好',51,1,'从未',0,'2026-03-26 13:45:58'),(121,15,12,2,'过去两周，我感觉平静、放松',57,1,'从未',0,'2026-03-26 13:45:58'),(122,15,13,3,'过去两周，我感觉精力充沛、做事有劲头',63,1,'从未',0,'2026-03-26 13:45:58'),(123,15,14,4,'过去两周，我起床后感觉休息充分',72,4,'超过一半时间',3,'2026-03-26 13:45:58'),(124,15,15,5,'过去两周，我的日常生活里有让我感兴趣的事情',79,5,'大部分时间',4,'2026-03-26 13:45:58'),(125,13,60,1,'焦虑心境',400,5,'惊恐、濒死感',4,'2026-03-26 13:52:48'),(126,13,61,2,'紧张感',405,5,'极度紧张失控',4,'2026-03-26 13:52:48'),(127,13,62,3,'害怕',410,5,'严重恐惧',4,'2026-03-26 13:52:48'),(128,13,63,4,'失眠',415,5,'彻夜不眠',4,'2026-03-26 13:52:48'),(129,13,64,5,'认知功能',420,5,'严重认知障碍',4,'2026-03-26 13:52:48'),(130,13,65,6,'抑郁心境',425,5,'严重抑郁',4,'2026-03-26 13:52:48'),(131,13,66,7,'肌肉系统症状',430,5,'严重肌肉症状',4,'2026-03-26 13:52:48'),(132,13,67,8,'感觉系统症状',435,5,'严重障碍',4,'2026-03-26 13:52:48'),(133,13,68,9,'心血管症状',440,5,'胸痛、血压波动',4,'2026-03-26 13:52:48'),(134,13,69,10,'呼吸系统症状',445,5,'过度换气',4,'2026-03-26 13:52:48'),(135,13,70,11,'胃肠道症状',450,5,'呕吐、吞咽困难',4,'2026-03-26 13:52:48'),(136,13,71,12,'泌尿生殖症状',455,5,'严重不适',4,'2026-03-26 13:52:48'),(137,13,72,13,'自主神经症状',460,5,'严重紊乱',4,'2026-03-26 13:52:48'),(138,13,73,14,'会谈行为表现',465,5,'无法配合',4,'2026-03-26 13:52:48');
/*!40000 ALTER TABLE `student_assessment_answer` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student_assessment_record`
--

DROP TABLE IF EXISTS `student_assessment_record`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student_assessment_record` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `student_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '学生学号',
  `semester` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '第1学期' COMMENT '学期',
  `scale_id` bigint NOT NULL COMMENT '量表ID',
  `scale_version_id` bigint NOT NULL COMMENT '量表版本ID',
  `scale_code` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '量表编码快照',
  `scale_name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '量表名称快照',
  `raw_score` int NOT NULL COMMENT '本次原始总分',
  `result_level` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '结果等级',
  `result_summary` varchar(255) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '结果说明',
  `suggestion` varchar(500) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '建议',
  `status` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'COMPLETED' COMMENT 'COMPLETED已完成',
  `submitted_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '提交时间',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  KEY `idx_student_assessment_record_student_id` (`student_id`),
  KEY `idx_student_assessment_record_semester` (`semester`),
  KEY `idx_student_assessment_record_scale_id` (`scale_id`),
  KEY `idx_student_assessment_record_scale_version_id` (`scale_version_id`),
  KEY `idx_student_assessment_record_submitted_at` (`submitted_at`),
  CONSTRAINT `fk_student_assessment_record_scale` FOREIGN KEY (`scale_id`) REFERENCES `assessment_scale` (`id`),
  CONSTRAINT `fk_student_assessment_record_scale_version` FOREIGN KEY (`scale_version_id`) REFERENCES `assessment_scale_version` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='学生单量表测评记录表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student_assessment_record`
--

LOCK TABLES `student_assessment_record` WRITE;
/*!40000 ALTER TABLE `student_assessment_record` DISABLE KEYS */;
INSERT INTO `student_assessment_record` VALUES (10,'2023010101','第1学期',14,4,'WHO5','WHO-5 幸福感指数',5,'较差','当前幸福感偏低，建议进一步评估情绪状态','建议继续做 PHQ-9 或联系心理老师','COMPLETED','2026-03-25 18:25:59','2026-03-25 18:25:44','2026-03-25 18:25:59'),(11,'2023010101','第1学期',15,3,'PHQ9','PHQ-9 抑郁筛查',0,'无或极轻','当前抑郁症状较少','建议保持规律生活并持续关注情绪变化','COMPLETED','2026-03-26 11:39:35','2026-03-26 11:39:35','2026-03-26 11:39:35'),(12,'2023010101','第1学期',16,12,'GAD7','GAD-7 焦虑筛查',18,'重度','焦虑风险较高','建议尽快接受专业评估','COMPLETED','2026-03-26 11:40:55','2026-03-26 11:40:55','2026-03-26 11:40:55'),(13,'2023010101','第1学期',18,10,'HAMD-14','HAMD焦虑',56,'重度焦虑','焦虑风险极高','建议尽快接受专业心理评估与临床干预','COMPLETED','2026-03-26 13:52:48','2026-03-26 11:41:30','2026-03-26 13:52:48'),(14,'2023010101','第2学期',14,4,'WHO5','WHO-5 幸福感指数',9,'较差','当前幸福感偏低，建议进一步评估情绪状态','建议继续做 PHQ-9 或联系心理老师','COMPLETED','2026-03-26 13:24:31','2026-03-26 13:24:31','2026-03-26 13:24:31'),(15,'2023010101','第3学期',14,4,'WHO5','WHO-5 幸福感指数',7,'较差','当前幸福感偏低，建议进一步评估情绪状态','建议继续做 PHQ-9 或联系心理老师','COMPLETED','2026-03-26 13:45:58','2026-03-26 13:45:58','2026-03-26 13:45:58');
/*!40000 ALTER TABLE `student_assessment_record` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `student_assessment_semester_summary`
--

DROP TABLE IF EXISTS `student_assessment_semester_summary`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `student_assessment_semester_summary` (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `student_id` varchar(50) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '学生学号',
  `semester` varchar(20) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '学期',
  `tested_count` int NOT NULL DEFAULT '0' COMMENT '已测数量',
  `score_summary` varchar(2000) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '分数汇总，如 PHQ9:10, GAD7:8, WHO5:16',
  `semester_level` varchar(20) COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '学期总等级：危险/轻危/无',
  `last_tested_at` datetime DEFAULT NULL COMMENT '最后测试时间',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT '更新时间',
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_student_semester` (`student_id`,`semester`),
  KEY `idx_student_id` (`student_id`),
  KEY `idx_semester` (`semester`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='学生学期测评汇总表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `student_assessment_semester_summary`
--

LOCK TABLES `student_assessment_semester_summary` WRITE;
/*!40000 ALTER TABLE `student_assessment_semester_summary` DISABLE KEYS */;
INSERT INTO `student_assessment_semester_summary` VALUES (3,'2023010101','第1学期',4,'WHO5:5, PHQ9:0, GAD7:18, HAMD-14:56','危险','2026-03-26 13:52:48','2026-03-25 18:25:44','2026-03-26 13:52:48'),(4,'2023010101','第2学期',1,'WHO5:9','未完成','2026-03-26 13:24:31','2026-03-26 13:24:31','2026-03-26 13:24:31'),(5,'2023010101','第3学期',1,'WHO5:7','未完成','2026-03-26 13:45:58','2026-03-26 13:45:58','2026-03-26 13:45:58');
/*!40000 ALTER TABLE `student_assessment_semester_summary` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `teacher`
--

DROP TABLE IF EXISTS `teacher`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `teacher` (
  `account` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '老师账号',
  `password` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '密码',
  `teacher_name` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '老师姓名',
  `office_location` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '办公地点',
  `phone` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '手机号',
  `avatar_url` varchar(500) COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '教师头像地址',
  PRIMARY KEY (`account`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='教师表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teacher`
--

LOCK TABLES `teacher` WRITE;
/*!40000 ALTER TABLE `teacher` DISABLE KEYS */;
INSERT INTO `teacher` VALUES ('teacher01','teacher@01','张老师','计算机学院2号楼301室','13900139001','/files/avatar/teacher/teacher01_1774588711431_55712c983d0b.png'),('teacher02','teacher@02','李老师','文学院1号楼405室','13900139002',NULL),('teacher03','teacher@03','王老师','医学院3号楼208室','13900139003',NULL),('teacher04','teacher@04','赵老师','商学院4号楼102室','13900139004',NULL),('teacher05','teacher@05','陈老师','外国语学院5号楼503室','13900139005',NULL);
/*!40000 ALTER TABLE `teacher` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `teacher_schedule`
--

DROP TABLE IF EXISTS `teacher_schedule`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `teacher_schedule` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `teacher_account` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci NOT NULL COMMENT '心理老师账号',
  `week_day` tinyint NOT NULL COMMENT '星期几：1周一 2周二 3周三 4周四 5周五 6周六 7周日',
  `start_time` time NOT NULL COMMENT '开始时间',
  `end_time` time NOT NULL COMMENT '结束时间',
  `max_appointments` int NOT NULL DEFAULT '1' COMMENT '该时段最大可预约人数',
  `remark` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL COMMENT '备注',
  `status` tinyint NOT NULL DEFAULT '1' COMMENT '1启用 0停用',
  `created_at` datetime DEFAULT CURRENT_TIMESTAMP,
  `updated_at` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`),
  UNIQUE KEY `uk_teacher_schedule_status` (`teacher_account`,`week_day`,`start_time`,`end_time`,`status`),
  KEY `idx_teacher_schedule_teacher_account` (`teacher_account`),
  KEY `idx_teacher_schedule_week_day` (`week_day`),
  CONSTRAINT `fk_teacher_schedule_teacher` FOREIGN KEY (`teacher_account`) REFERENCES `teacher` (`account`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci COMMENT='心理老师办公时间表';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `teacher_schedule`
--

LOCK TABLES `teacher_schedule` WRITE;
/*!40000 ALTER TABLE `teacher_schedule` DISABLE KEYS */;
INSERT INTO `teacher_schedule` VALUES (1,'teacher01',1,'14:00:00','17:00:00',4,'',1,'2026-03-15 02:29:57','2026-03-22 19:39:48'),(2,'teacher01',3,'09:00:00','11:00:00',2,'准时到达\n',1,'2026-03-15 02:29:57','2026-03-21 10:51:41'),(3,'teacher02',2,'15:00:00','17:00:00',2,'周二下午接待',1,'2026-03-15 02:29:57','2026-03-15 02:29:57'),(4,'teacher02',4,'09:00:00','12:00:00',3,'周四上午接待',1,'2026-03-15 02:29:57','2026-03-15 02:29:57'),(5,'teacher03',5,'14:30:00','17:30:00',2,'周五下午接待',1,'2026-03-15 02:29:57','2026-03-15 02:29:57'),(7,'teacher01',7,'08:00:00','12:00:00',2,'',1,'2026-03-21 11:42:30','2026-03-21 11:42:30');
/*!40000 ALTER TABLE `teacher_schedule` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping events for database 'mental_health'
--

--
-- Dumping routines for database 'mental_health'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-03-27 13:59:03
